### Pandas ###

In [7]:
import warnings 
warnings.filterwarnings('ignore')

In [11]:
import pandas as pd
import numpy as np

***Pandas Series***

In [12]:
a=pd.Series()
print(a)

Series([], dtype: object)

In [16]:
info = np.array(['B','h','a','r','g','a','v','i'])
a=pd.Series(info)
print(a)

0    B
1    h
2    a
3    r
4    g
5    a
6    v
7    i
dtype: object

In [18]:
list1=["bhargavi","geethika","keerthana"]
b=pd.Series(list1)
print(b)

0     bhargavi
1     geethika
2    keerthana
dtype: object

In [24]:
dict1={'a':7,'b':8,'c':18}
a=pd.Series(dict1)
print(a)

a     7
b     8
c    18
dtype: int64

In [36]:
#Scaler Values --> Index must be provided --> the value should match the length of index.
x=pd.Series([1,2,3,4],index=[0,1,2,3])
print(x)

0    1
1    2
2    3
3    4
dtype: int64

In [56]:
x=pd.Series([1,2,3],index=['a','b','c'])
print(x)
print(x[2])
print(x['b'])
print(x.index)
print(x.values)
print(x.dtype)
print(x.size)
print(x.shape)
print(len(x))

a    1
b    2
c    3
dtype: int64
3
2
Index(['a', 'b', 'c'], dtype='object')
[1 2 3]
int64
3
(3,)
3

In [62]:
a=pd.Series(data=[1,2,3,np.NaN],index=[0,1,2,3])
print(a)
print(a.hasnans)

0    1.0
1    2.0
2    3.0
3    NaN
dtype: float64
True

***Pandas DataFrame***

In [66]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

In [72]:
list1=["pandas","numpy","matplotlib","sckitlearn"]
df=pd.DataFrame(list1)
df

            0
0      pandas
1       numpy
2  matplotlib
3  sckitlearn

In [74]:
df1=pd.DataFrame(["bhargavi","Geethika","Keerthana"])
df1

           0
0   bhargavi
1   Geethika
2  Keerthana

In [85]:
info = {'ID':[101,102,103,104,105],"Department":["csai","cse","csds","ece","eee"]}
df = pd.DataFrame(info)
df

    ID Department
0  101       csai
1  102        cse
2  103       csds
3  104        ece
4  105        eee

In [91]:
employee = ["Bhargavi","Keerthana","Geethika","Priyanka","Hema"]
id=[13,15,12,14,15]
emp_series=pd.Series(employee)
id_series=pd.Series(id)
frame={"emp":emp_series,"Id":id_series}
df=pd.DataFrame(frame)
df

         emp  Id
0   Bhargavi  13
1  Keerthana  15
2   Geethika  12
3   Priyanka  14
4       Hema  15

In [97]:
info = {"one":pd.Series([1,2,3,4,5,6,7], index=['a','b','c','e','f','g','h']),
       "two":pd.Series([1,2,3,4,5,6,7,8], index=['a','b','c','d','e','f','g','h'])}
df=pd.DataFrame(info)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4
e  4.0    5
f  5.0    6
g  6.0    7
h  7.0    8

In [99]:
df['three']=df['one']+df['two']
df

   one  two  three
a  1.0    1    2.0
b  2.0    2    4.0
c  3.0    3    6.0
d  NaN    4    NaN
e  4.0    5    9.0
f  5.0    6   11.0
g  6.0    7   13.0
h  7.0    8   15.0

In [121]:
del df['three']

KeyError: 'three'

In [123]:
df

   two
a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8

In [125]:
df

   two
a    1
b    2
c    3
d    4
e    5
f    6
g    7
h    8

In [159]:
#loc and iloc
#loc --> it will take manually generated index values
#iloc --> It will take original index values
data=pd.Series(["bhargavi","keerthana","geethika","priyanka"],index=[1,3,5,7])
print(data)
print(data[7])
print("***********************************")
print("loc values")
print(data.loc[1])
print(data.loc[3])
print(data.loc[5])
print(data.loc[7])
print("***********************************")
print("iloc values")
print(data.iloc[0])
print(data.iloc[3])
print("************************************")
print(data.loc[1:5])
print("*************************************")
print(data.iloc[0:5])

1     bhargavi
3    keerthana
5     geethika
7     priyanka
dtype: object
priyanka
***********************************
loc values
bhargavi
keerthana
geethika
priyanka
***********************************
iloc values
bhargavi
priyanka
************************************
1     bhargavi
3    keerthana
5     geethika
dtype: object
*************************************
1     bhargavi
3    keerthana
5     geethika
7     priyanka
dtype: object

In [167]:
#append()
d1=pd.DataFrame([[7,8],[9,10]],columns=['x','y'])
d2=pd.DataFrame([[67,89],[13,14]],columns=['x','y'])
d=d1.add(d2)
d
#d1.append(d2)
#  X  Y
#0 7  8
#1 9  10
#0 67 89
#1 13 14

    x   y
0  74  97
1  22  24

In [173]:
data={"Name":['A','B','C','D'],'Age':['25','21','62','41']}
df=pd.DataFrame(data)
df.dtypes

#astype --> converts one datatype to another datatype
df['Age']=df['Age'].astype(int)
df.dtypes

Name    object
Age      int32
dtype: object

In [179]:
df.count() #here it will count no.of elements in columns as length function but not specific elements

Name    4
Age     4
dtype: int64

In [181]:
df.describe()

             Age
count   4.000000
mean   37.250000
std    18.625699
min    21.000000
25%    24.000000
50%    33.000000
75%    46.250000
max    62.000000

In [183]:
df.describe(include='all')

       Name        Age
count     4   4.000000
unique    4        NaN
top       A        NaN
freq      1        NaN
mean    NaN  37.250000
std     NaN  18.625699
min     NaN  21.000000
25%     NaN  24.000000
50%     NaN  33.000000
75%     NaN  46.250000
max     NaN  62.000000

In [185]:
#dropna - it will drop/delete null values
data={"Name":['A','B','C','D'],'Age':[np.nan,21,62,np.nan]}
df=pd.DataFrame(data)
df

  Name   Age
0    A   NaN
1    B  21.0
2    C  62.0
3    D   NaN

In [187]:
df1=df.dropna()
df1

  Name   Age
1    B  21.0
2    C  62.0

In [199]:
#fillna() -->
df1=df.fillna(0)
df1

  Name   Age
0    A   0.0
1    B  21.0
2    C  62.0
3    D   0.0

In [203]:
data={"Name":['A','B','C','D'],'Age':[25,21,62,41]}
df=pd.DataFrame(data)
df['Age'].replace(25,22,inplace=True)
df

  Name  Age
0    A   22
1    B   21
2    C   62
3    D   41

In [13]:
df = pd.read_csv('data.csv')
df

        Name  Age    Location  Salary
0   Bhargavi   21      Guntur   50000
1   Geethika   21      Kadapa   80000
2  Keerthana   23   Hyderabad   60000
3   Priyanka   22  Amaravathi   45000
4       Hema   21      Guntur  100000
5    Asritha   20      Guntur   40000

In [19]:
df.head() #it generates first 5 rows

        Name  Age    Location  Salary
0   Bhargavi   21      Guntur   50000
1   Geethika   21      Kadapa   80000
2  Keerthana   23   Hyderabad   60000
3   Priyanka   22  Amaravathi   45000
4       Hema   21      Guntur  100000

In [21]:
df.tail() #it generates last 5 rows

        Name  Age    Location  Salary
1   Geethika   21      Kadapa   80000
2  Keerthana   23   Hyderabad   60000
3   Priyanka   22  Amaravathi   45000
4       Hema   21      Guntur  100000
5    Asritha   20      Guntur   40000

In [23]:
df.shape

(6, 4)

In [25]:
df.iloc[2]

Name        Keerthana
Age                23
Location    Hyderabad
Salary          60000
Name: 2, dtype: object

In [27]:
df.iloc[1]

Name        Geethika
Age               21
Location      Kadapa
Salary         80000
Name: 1, dtype: object

In [29]:
df.iloc[0]

Name        Bhargavi
Age               21
Location      Guntur
Salary         50000
Name: 0, dtype: object

In [33]:
df.describe()

             Age         Salary
count   6.000000       6.000000
mean   21.333333   62500.000000
std     1.032796   23184.046239
min    20.000000   40000.000000
25%    21.000000   46250.000000
50%    21.000000   55000.000000
75%    21.750000   75000.000000
max    23.000000  100000.000000

In [35]:
df.describe(include='all')

            Name        Age Location         Salary
count          6   6.000000        6       6.000000
unique         6        NaN        4            NaN
top     Bhargavi        NaN   Guntur            NaN
freq           1        NaN        3            NaN
mean         NaN  21.333333      NaN   62500.000000
std          NaN   1.032796      NaN   23184.046239
min          NaN  20.000000      NaN   40000.000000
25%          NaN  21.000000      NaN   46250.000000
50%          NaN  21.000000      NaN   55000.000000
75%          NaN  21.750000      NaN   75000.000000
max          NaN  23.000000      NaN  100000.000000

In [41]:
df.Salary.value_counts()

Salary
50000     1
80000     1
60000     1
45000     1
100000    1
40000     1
Name: count, dtype: int64

In [43]:
df.apply(np.max)

Name        Priyanka
Age               23
Location      Kadapa
Salary        100000
dtype: object

In [45]:
df.apply(np.min)

Name           Asritha
Age                 20
Location    Amaravathi
Salary           40000
dtype: object

In [47]:
df

        Name  Age    Location  Salary
0   Bhargavi   21      Guntur   50000
1   Geethika   21      Kadapa   80000
2  Keerthana   23   Hyderabad   60000
3   Priyanka   22  Amaravathi   45000
4       Hema   21      Guntur  100000
5    Asritha   20      Guntur   40000

In [49]:
df.set_index('Age')

          Name    Location  Salary
Age
21    Bhargavi      Guntur   50000
21    Geethika      Kadapa   80000
23   Keerthana   Hyderabad   60000
22    Priyanka  Amaravathi   45000
21        Hema      Guntur  100000
20     Asritha      Guntur   40000

In [51]:
df.sort_values('Age')

        Name  Age    Location  Salary
5    Asritha   20      Guntur   40000
0   Bhargavi   21      Guntur   50000
1   Geethika   21      Kadapa   80000
4       Hema   21      Guntur  100000
3   Priyanka   22  Amaravathi   45000
2  Keerthana   23   Hyderabad   60000

In [53]:
df['Salary'].unique()

array([ 50000,  80000,  60000,  45000, 100000,  40000], dtype=int64)

In [55]:
#slicing rows
df[1:4]

        Name  Age    Location  Salary
1   Geethika   21      Kadapa   80000
2  Keerthana   23   Hyderabad   60000
3   Priyanka   22  Amaravathi   45000

In [57]:
df[0:5]

        Name  Age    Location  Salary
0   Bhargavi   21      Guntur   50000
1   Geethika   21      Kadapa   80000
2  Keerthana   23   Hyderabad   60000
3   Priyanka   22  Amaravathi   45000
4       Hema   21      Guntur  100000

In [59]:
new_df=df[['Name','Age']]
new_df

        Name  Age
0   Bhargavi   21
1   Geethika   21
2  Keerthana   23
3   Priyanka   22
4       Hema   21
5    Asritha   20

In [61]:
df.loc[df.Age==23]

        Name  Age   Location  Salary
2  Keerthana   23  Hyderabad   60000

In [63]:
df.loc[df.Age==21]

       Name  Age Location  Salary
0  Bhargavi   21   Guntur   50000
1  Geethika   21   Kadapa   80000
4      Hema   21   Guntur  100000

In [69]:
df.loc[(df.Age>20) & (df.Salary>45000), ['Name', 'Location']]

        Name   Location
0   Bhargavi     Guntur
1   Geethika     Kadapa
2  Keerthana  Hyderabad
4       Hema     Guntur